vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/dsu.h
/*
 * Component description for DSU
 *
 * Copyright (c) 2026 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _PIC32CMPL10_DSU_COMPONENT_H_
#define _PIC32CMPL10_DSU_COMPONENT_H_

#if !defined(DISABLE_CMSIS)
#include "core_cm0plus.h"
#endif /* !defined(DISABLE_CMSIS) */

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR DSU                       */
/* ************************************************************************** */

/* -------- DSU_CTRLB : (DSU Offset: 0x04) (R/W 32) Control B -------- */
#define DSU_CTRLB_RESETVALUE                  _UINT32_(0x04)                                       /*  (DSU_CTRLB) Control B  Reset Value */

#define DSU_CTRLB_DCCDMALVL0_Pos              _UINT32_(0)                                          /* (DSU_CTRLB) DMA Trigger 0 Level Position */
#define DSU_CTRLB_DCCDMALVL0_Msk              (_UINT32_(0x1) << DSU_CTRLB_DCCDMALVL0_Pos)          /* (DSU_CTRLB) DMA Trigger 0 Level Mask */
#define DSU_CTRLB_DCCDMALVL0(value)           (DSU_CTRLB_DCCDMALVL0_Msk & (_UINT32_(value) << DSU_CTRLB_DCCDMALVL0_Pos)) /* Assignment of value for DCCDMALVL0 in the DSU_CTRLB register */
#define   DSU_CTRLB_DCCDMALVL0_EMPTY_Val      _UINT32_(0x0)                                        /* (DSU_CTRLB) Trigger n rises when DCCn is read and falls when it is written  */
#define   DSU_CTRLB_DCCDMALVL0_FULL_Val       _UINT32_(0x1)                                        /* (DSU_CTRLB) Trigger n rises when DCCn is written and falls when it is read  */
#define DSU_CTRLB_DCCDMALVL0_EMPTY            (DSU_CTRLB_DCCDMALVL0_EMPTY_Val << DSU_CTRLB_DCCDMALVL0_Pos) /* (DSU_CTRLB) Trigger n rises when DCCn is read and falls when it is written Position */
#define DSU_CTRLB_DCCDMALVL0_FULL             (DSU_CTRLB_DCCDMALVL0_FULL_Val << DSU_CTRLB_DCCDMALVL0_Pos) /* (DSU_CTRLB) Trigger n rises when DCCn is written and falls when it is read Position */
#define DSU_CTRLB_DCCDMALVL1_Pos              _UINT32_(1)                                          /* (DSU_CTRLB) DMA Trigger 1 Level Position */
#define DSU_CTRLB_DCCDMALVL1_Msk              (_UINT32_(0x1) << DSU_CTRLB_DCCDMALVL1_Pos)          /* (DSU_CTRLB) DMA Trigger 1 Level Mask */
#define DSU_CTRLB_DCCDMALVL1(value)           (DSU_CTRLB_DCCDMALVL1_Msk & (_UINT32_(value) << DSU_CTRLB_DCCDMALVL1_Pos)) /* Assignment of value for DCCDMALVL1 in the DSU_CTRLB register */
#define   DSU_CTRLB_DCCDMALVL1_EMPTY_Val      _UINT32_(0x0)                                        /* (DSU_CTRLB) Trigger n rises when DCCn is read and falls when it is written  */
#define   DSU_CTRLB_DCCDMALVL1_FULL_Val       _UINT32_(0x1)                                        /* (DSU_CTRLB) Trigger n rises when DCCn is written and falls when it is read  */
#define DSU_CTRLB_DCCDMALVL1_EMPTY            (DSU_CTRLB_DCCDMALVL1_EMPTY_Val << DSU_CTRLB_DCCDMALVL1_Pos) /* (DSU_CTRLB) Trigger n rises when DCCn is read and falls when it is written Position */
#define DSU_CTRLB_DCCDMALVL1_FULL             (DSU_CTRLB_DCCDMALVL1_FULL_Val << DSU_CTRLB_DCCDMALVL1_Pos) /* (DSU_CTRLB) Trigger n rises when DCCn is written and falls when it is read Position */
#define DSU_CTRLB_QOS_Pos                     _UINT32_(2)                                          /* (DSU_CTRLB) DSU QoS Level Position */
#define DSU_CTRLB_QOS_Msk                     (_UINT32_(0x3) << DSU_CTRLB_QOS_Pos)                 /* (DSU_CTRLB) DSU QoS Level Mask */
#define DSU_CTRLB_QOS(value)                  (DSU_CTRLB_QOS_Msk & (_UINT32_(value) << DSU_CTRLB_QOS_Pos)) /* Assignment of value for QOS in the DSU_CTRLB register */
#define   DSU_CTRLB_QOS_DISABLE_Val           _UINT32_(0x0)                                        /* (DSU_CTRLB) Background (no sensitive operation)  */
#define   DSU_CTRLB_QOS_LOW_Val               _UINT32_(0x1)                                        /* (DSU_CTRLB) Sensitive bandwidth  */
#define   DSU_CTRLB_QOS_MEDIUM_Val            _UINT32_(0x2)                                        /* (DSU_CTRLB) Sensitive latency  */
#define   DSU_CTRLB_QOS_HIGH_Val              _UINT32_(0x3)                                        /* (DSU_CTRLB) Critical latency  */
#define DSU_CTRLB_QOS_DISABLE                 (DSU_CTRLB_QOS_DISABLE_Val << DSU_CTRLB_QOS_Pos)     /* (DSU_CTRLB) Background (no sensitive operation) Position */
#define DSU_CTRLB_QOS_LOW                     (DSU_CTRLB_QOS_LOW_Val << DSU_CTRLB_QOS_Pos)         /* (DSU_CTRLB) Sensitive bandwidth Position */
#define DSU_CTRLB_QOS_MEDIUM                  (DSU_CTRLB_QOS_MEDIUM_Val << DSU_CTRLB_QOS_Pos)      /* (DSU_CTRLB) Sensitive latency Position */
#define DSU_CTRLB_QOS_HIGH                    (DSU_CTRLB_QOS_HIGH_Val << DSU_CTRLB_QOS_Pos)        /* (DSU_CTRLB) Critical latency Position */
#define DSU_CTRLB_Msk                         _UINT32_(0x0000000F)                                 /* (DSU_CTRLB) Register Mask  */

#define DSU_CTRLB_DCCDMALVL_Pos               _UINT32_(0)                                          /* (DSU_CTRLB Position) DMA Trigger x Level */
#define DSU_CTRLB_DCCDMALVL_Msk               (_UINT32_(0x3) << DSU_CTRLB_DCCDMALVL_Pos)           /* (DSU_CTRLB Mask) DCCDMALVL */
#define DSU_CTRLB_DCCDMALVL(value)            (DSU_CTRLB_DCCDMALVL_Msk & (_UINT32_(value) << DSU_CTRLB_DCCDMALVL_Pos)) 

/* -------- DSU_WPCTRL : (DSU Offset: 0x08) (R/W 32) Write Protection Control -------- */
#define DSU_WPCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_WPCTRL) Write Protection Control  Reset Value */

