vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/dsu.h
/* -------- DSU_BCC : (DSU Offset: 0x110) (R/W 32) Boot ROM Channel # -------- */
#define DSU_BCC_DATA_Pos                      _UINT32_(0)                                          /* (DSU_BCC) Data Position */
#define DSU_BCC_DATA_Msk                      (_UINT32_(0xFFFFFFFF) << DSU_BCC_DATA_Pos)           /* (DSU_BCC) Data Mask */
#define DSU_BCC_DATA(value)                   (DSU_BCC_DATA_Msk & (_UINT32_(value) << DSU_BCC_DATA_Pos)) /* Assignment of value for DATA in the DSU_BCC register */
#define DSU_BCC_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_BCC) Register Mask  */


/* -------- DSU_DCC : (DSU Offset: 0x118) (R/W 32) Debug Communication Channel # -------- */
#define DSU_DCC_DATA_Pos                      _UINT32_(0)                                          /* (DSU_DCC) Data Position */
#define DSU_DCC_DATA_Msk                      (_UINT32_(0xFFFFFFFF) << DSU_DCC_DATA_Pos)           /* (DSU_DCC) Data Mask */
#define DSU_DCC_DATA(value)                   (DSU_DCC_DATA_Msk & (_UINT32_(value) << DSU_DCC_DATA_Pos)) /* Assignment of value for DATA in the DSU_DCC register */
#define DSU_DCC_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_DCC) Register Mask  */


/* -------- DSU_DID : (DSU Offset: 0x120) ( R/ 32) Device Identification -------- */
#define DSU_DID_RESETVALUE                    _UINT32_(0xBA03053)                                  /*  (DSU_DID) Device Identification  Reset Value */

#define DSU_DID_FV_Pos                        _UINT32_(0)                                          /* (DSU_DID) Fixed Value of 1 Position */
#define DSU_DID_FV_Msk                        (_UINT32_(0x1) << DSU_DID_FV_Pos)                    /* (DSU_DID) Fixed Value of 1 Mask */
#define DSU_DID_FV(value)                     (DSU_DID_FV_Msk & (_UINT32_(value) << DSU_DID_FV_Pos)) /* Assignment of value for FV in the DSU_DID register */
#define DSU_DID_MANID_Pos                     _UINT32_(1)                                          /* (DSU_DID) JEDEC Manufacture ID Position */
#define DSU_DID_MANID_Msk                     (_UINT32_(0x7FF) << DSU_DID_MANID_Pos)               /* (DSU_DID) JEDEC Manufacture ID Mask */
#define DSU_DID_MANID(value)                  (DSU_DID_MANID_Msk & (_UINT32_(value) << DSU_DID_MANID_Pos)) /* Assignment of value for MANID in the DSU_DID register */
#define DSU_DID_PNDID_Pos                     _UINT32_(12)                                         /* (DSU_DID) Part Number Device ID Position */
#define DSU_DID_PNDID_Msk                     (_UINT32_(0xFF) << DSU_DID_PNDID_Pos)                /* (DSU_DID) Part Number Device ID Mask */
#define DSU_DID_PNDID(value)                  (DSU_DID_PNDID_Msk & (_UINT32_(value) << DSU_DID_PNDID_Pos)) /* Assignment of value for PNDID in the DSU_DID register */
#define DSU_DID_PNMID_Pos                     _UINT32_(20)                                         /* (DSU_DID) Part Number Mask ID Position */
#define DSU_DID_PNMID_Msk                     (_UINT32_(0xFF) << DSU_DID_PNMID_Pos)                /* (DSU_DID) Part Number Mask ID Mask */
#define DSU_DID_PNMID(value)                  (DSU_DID_PNMID_Msk & (_UINT32_(value) << DSU_DID_PNMID_Pos)) /* Assignment of value for PNMID in the DSU_DID register */
#define DSU_DID_VER_Pos                       _UINT32_(28)                                         /* (DSU_DID) Version Code Position */
#define DSU_DID_VER_Msk                       (_UINT32_(0xF) << DSU_DID_VER_Pos)                   /* (DSU_DID) Version Code Mask */
#define DSU_DID_VER(value)                    (DSU_DID_VER_Msk & (_UINT32_(value) << DSU_DID_VER_Pos)) /* Assignment of value for VER in the DSU_DID register */
#define DSU_DID_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_DID) Register Mask  */


/* -------- DSU_DAL : (DSU Offset: 0x124) ( R/ 32) Debugger Access Level -------- */
#define DSU_DAL_CPU0_Pos                      _UINT32_(0)                                          /* (DSU_DAL) CPU 0 Debugger Access Level Position */
#define DSU_DAL_CPU0_Msk                      (_UINT32_(0x3) << DSU_DAL_CPU0_Pos)                  /* (DSU_DAL) CPU 0 Debugger Access Level Mask */
#define DSU_DAL_CPU0(value)                   (DSU_DAL_CPU0_Msk & (_UINT32_(value) << DSU_DAL_CPU0_Pos)) /* Assignment of value for CPU0 in the DSU_DAL register */
#define   DSU_DAL_CPU0_SECURED_Val            _UINT32_(0x0)                                        /* (DSU_DAL) The Debugger targeting the CPU0 domain can only access the DSU external address space; otherwise, debugger access is disabled.  */
#define   DSU_DAL_CPU0_FULL_DEBUG_Val         _UINT32_(0x2)                                        /* (DSU_DAL) The Debugger has unrestricted access  */
#define DSU_DAL_CPU0_SECURED                  (DSU_DAL_CPU0_SECURED_Val << DSU_DAL_CPU0_Pos)       /* (DSU_DAL) The Debugger targeting the CPU0 domain can only access the DSU external address space; otherwise, debugger access is disabled. Position */
#define DSU_DAL_CPU0_FULL_DEBUG               (DSU_DAL_CPU0_FULL_DEBUG_Val << DSU_DAL_CPU0_Pos)    /* (DSU_DAL) The Debugger has unrestricted access Position */
#define DSU_DAL_Msk                           _UINT32_(0x00000003)                                 /* (DSU_DAL) Register Mask  */


/* -------- DSU_ENTRY0 : (DSU Offset: 0x1000) ( R/ 32) CoreSight ROM Table Entry 0 -------- */
#define DSU_ENTRY0_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY0) CoreSight Entry Present Position */
#define DSU_ENTRY0_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY0_EPRES_Pos)              /* (DSU_ENTRY0) CoreSight Entry Present Mask */
#define DSU_ENTRY0_EPRES(value)               (DSU_ENTRY0_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY0_EPRES_Pos)) /* Assignment of value for EPRES in the DSU_ENTRY0 register */
#define DSU_ENTRY0_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY0) CoreSight Rom Table Format Position */
#define DSU_ENTRY0_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY0_FMT_Pos)                /* (DSU_ENTRY0) CoreSight Rom Table Format Mask */
#define DSU_ENTRY0_FMT(value)                 (DSU_ENTRY0_FMT_Msk & (_UINT32_(value) << DSU_ENTRY0_FMT_Pos)) /* Assignment of value for FMT in the DSU_ENTRY0 register */
#define DSU_ENTRY0_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY0) CoreSight ROM Table Address Offset Position */
#define DSU_ENTRY0_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY0_ADDOFF_Pos)         /* (DSU_ENTRY0) CoreSight ROM Table Address Offset Mask */
#define DSU_ENTRY0_ADDOFF(value)              (DSU_ENTRY0_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY0_ADDOFF_Pos)) /* Assignment of value for ADDOFF in the DSU_ENTRY0 register */
#define DSU_ENTRY0_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY0) Register Mask  */


/* -------- DSU_ENTRY1 : (DSU Offset: 0x1004) ( R/ 32) CoreSight ROM Table Entry 1 -------- */
#define DSU_ENTRY1_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY1) CoreSight Entry Present Position */
#define DSU_ENTRY1_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY1_EPRES_Pos)              /* (DSU_ENTRY1) CoreSight Entry Present Mask */
#define DSU_ENTRY1_EPRES(value)               (DSU_ENTRY1_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY1_EPRES_Pos)) /* Assignment of value for EPRES in the DSU_ENTRY1 register */
#define DSU_ENTRY1_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY1) CoreSight Rom Table Format Position */
#define DSU_ENTRY1_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY1_FMT_Pos)                /* (DSU_ENTRY1) CoreSight Rom Table Format Mask */
#define DSU_ENTRY1_FMT(value)                 (DSU_ENTRY1_FMT_Msk & (_UINT32_(value) << DSU_ENTRY1_FMT_Pos)) /* Assignment of value for FMT in the DSU_ENTRY1 register */
#define DSU_ENTRY1_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY1) CoreSight ROM Table Address Offset Position */
#define DSU_ENTRY1_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY1_ADDOFF_Pos)         /* (DSU_ENTRY1) CoreSight ROM Table Address Offset Mask */
#define DSU_ENTRY1_ADDOFF(value)              (DSU_ENTRY1_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY1_ADDOFF_Pos)) /* Assignment of value for ADDOFF in the DSU_ENTRY1 register */
#define DSU_ENTRY1_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY1) Register Mask  */


