vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/dsu.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* DSU register API structure */
typedef struct
{  /* Device Service Unit */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       DSU_CTRLB;          /* Offset: 0x04 (R/W  32) Control B */
  __IO  uint32_t                       DSU_WPCTRL;         /* Offset: 0x08 (R/W  32) Write Protection Control */
  __I   uint8_t                        Reserved2[0xF4];
  __IO  uint32_t                       DSU_CTRLC;          /* Offset: 0x100 (R/W  32) Control C */
  __I   uint32_t                       DSU_STATUSA;        /* Offset: 0x104 (R/   32) Status A */
  __I   uint32_t                       DSU_STATUSB;        /* Offset: 0x108 (R/   32) Status B */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       DSU_BCC[2];         /* Offset: 0x110 (R/W  32) Boot ROM Channel # */
  __IO  uint32_t                       DSU_DCC[2];         /* Offset: 0x118 (R/W  32) Debug Communication Channel # */
  __I   uint32_t                       DSU_DID;            /* Offset: 0x120 (R/   32) Device Identification */
  __I   uint32_t                       DSU_DAL;            /* Offset: 0x124 (R/   32) Debugger Access Level */
  __I   uint8_t                        Reserved4[0xED8];
  __I   uint32_t                       DSU_ENTRY0;         /* Offset: 0x1000 (R/   32) CoreSight ROM Table Entry 0 */
  __I   uint32_t                       DSU_ENTRY1;         /* Offset: 0x1004 (R/   32) CoreSight ROM Table Entry 1 */
  __I   uint32_t                       DSU_ENTRY2;         /* Offset: 0x1008 (R/   32) CoreSight ROM Table Entry 2 */
  __I   uint32_t                       DSU_ENTRY3;         /* Offset: 0x100C (R/   32) CoreSight ROM Table Entry 3 */
  __I   uint8_t                        Reserved5[0xFBC];
  __I   uint32_t                       DSU_MEMTYPE;        /* Offset: 0x1FCC (R/   32) CoreSight ROM Table Memory Type */
  __I   uint32_t                       DSU_PID4;           /* Offset: 0x1FD0 (R/   32) CoreSight Peripheral Identification 4 */
  __I   uint32_t                       DSU_PID5;           /* Offset: 0x1FD4 (R/   32) CoreSight Peripheral Identification 5 */
  __I   uint32_t                       DSU_PID6;           /* Offset: 0x1FD8 (R/   32) CoreSight Peripheral Identification 6 */
  __I   uint32_t                       DSU_PID7;           /* Offset: 0x1FDC (R/   32) CoreSight Peripheral Identification 7 */
  __I   uint32_t                       DSU_PID0;           /* Offset: 0x1FE0 (R/   32) CoreSight Peripheral Identification 0 */
  __I   uint32_t                       DSU_PID1;           /* Offset: 0x1FE4 (R/   32) CoreSight Peripheral Identification 1 */
  __I   uint32_t                       DSU_PID2;           /* Offset: 0x1FE8 (R/   32) CoreSight Peripheral Identification 2 */
  __I   uint32_t                       DSU_PID3;           /* Offset: 0x1FEC (R/   32) CoreSight Peripheral Identification 3 */
  __I   uint32_t                       DSU_CID0;           /* Offset: 0x1FF0 (R/   32) CoreSight Component Identification 0 */
  __I   uint32_t                       DSU_CID1;           /* Offset: 0x1FF4 (R/   32) CoreSight Component Identification 1 */
  __I   uint32_t                       DSU_CID2;           /* Offset: 0x1FF8 (R/   32) CoreSight Component Identification 2 */
  __I   uint32_t                       DSU_CID3;           /* Offset: 0x1FFC (R/   32) CoreSight Component Identification 3 */
} dsu_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMPL10_DSU_COMPONENT_H_ */
